lab11_ci/ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();

        if ($q) {
            $artikel = $model->like('judul', $q)->paginate(10);
            $total   = $model->like('judul', $q)->countAllResults();
        } else {
            $artikel = $model->paginate(10);
            $total   = $model->countAll();
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%kedua%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%kedua%' ESCAPE '!'
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
SELECT COUNT(*) AS `numrows` FROM `artikel`